       IDENTIFICATION DIVISION.
      *    demostrando constantes.
       PROGRAM-ID. PROG2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.

       PROGRAMA-BEGIN.
           DISPLAY "HELLO WORLD".
           DISPLAY 55.
           DISPLAY 12.607.
       PROGRAM-DONE.
           STOP RUN.
