       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG17.
      *    DEMONSTRA O OPERADOR OR.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  VALOR PIC 9(3).
       01  NOME PIC X(20).
       01  VALOR2 PIC 9(2).

       PROCEDURE DIVISION.

       PROGRAM-BEGIN.

           DISPLAY "--- USO DO OR-----".
           DISPLAY "INFORME UM NOME: ".
           ACCEPT NOME.
           DISPLAY "INFORME UM NUMERO".
           ACCEPT VALOR.

           IF NOME= "ANA" OR VALOR=30 AND VALOR2 >=67
               DISPLAY "A CONDICAO EH VERDADEIRA"
      -    "É MAIOR QUE 67".
           PROGRAM-DONE.
               STOP RUN.
