       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG36.
      *    PROGRAMA PARA INSERIR DADOS EM ARQUIVOS INDEXADO.
      *    WHITE COM INVALID KEY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQUIVO-FUNCIONARIO
           ASSIGN TO "funcionarios.dat"
           ORGANIZATION IS INDEXED
           RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.
       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(20).
           05 FUNCIONARIO-ENDERECO PIC X(50).
           05 FUNCIONARIO-TELEFONE PIC X(15).
           05 FUNCIONARIO-EMAIL PIC X(30).


       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.

           OPEN I-O ARQUIVO-FUNCIONARIO.

           PERFORM LER-E-ESCREVE-REGISTRO.

           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.

       LER-E-ESCREVE-REGISTRO.
           MOVE SPACE TO FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO(1-9999)".
           ACCEPT FUNCIONARIO-CODIGO.
           DISPLAY "INFORME O NOME DO FUNCIONARIO : ".
           ACCEPT FUNCIONARIO-NOME.
           DISPLAY "INFORME O ENDERECO DO FUNCIONARIO : ".
           ACCEPT FUNCIONARIO-ENDERECO.
           DISPLAY "INFORME O EMAIL DO FUNCIONARIO : "
           ACCEPT FUNCIONARIO-EMAIL.
           DISPLAY "INFORME O TELEFONE DO FUNCIONARIO : "
           ACCEPT FUNCIONARIO-TELEFONE.

           WRITE FUNCIONARIO-REGISTRO
           INVALID KEY
           DISPLAY "CODIGO: " FUNCIONARIO-CODIGO "JA FOI CADASTRADO".
